# 1. 什么是面向过程？什么是面向对象？（多行注释）
"""
面向过程
有明确目标，面对目标逐步用代码完成需求
"""
"""
面向对象（封装 继承 多态）
面向对象相比于面向过程是更大的封装，根据职责在一个对象中封装多个方法
调用不同对象去执行不同指令完成任务
在完成某一需求前，首先确定职责---要做的事情（方法）
根据职责确定不同的对象，在对象内部封装不同的方法（多个）
"""
# 2. 为什么会出现面向对象的编程方式？面向对象解决了哪些问题？（多行注释）
"""
为了应对复杂项目的开发，提供固定的套路，使逻辑更加清晰
有固定的开发过程，能够完成更加复杂的编程
结构更清晰 主程序功能大大简化
"""
# 3. 什么是类？什么是对象？（多行注释）
"""
类是抽象的，不能直接使用，不具体，是一个模板
类是一个模板，负责创建对象，具有共同特征和行为的一组对象抽象定义
"""
"""
不同类包含多个对象
哪一个类创建出来的对象，就有哪一个类的属性，方法
"""
"""
先有类，再有对象
类只需要一个，对象可以有很多
同一个类中创建出来的不同对象属性可以不同
"""
# 4. 类包含哪些要素？（注意审题，不是面向对象的三要素，而是类包含的要素）
"""
类包含的三要素
类名 这类事物的名字，满足大驼峰命名法(每一个单词的首字母都要大写，但是不需要下划线)
属性 这类事物具有什么样的特征
方法 这类事物具有什么样的行为
"""